In [4]:
# create and display a DataFrame from a specified dictionary data which has the index labels
import pandas as pd
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data = pd.DataFrame(exam_data, index = ['a','b','c','d','e','f','g','h','i','j'])
exam_data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [13]:
# select the rows where number of attempts in the examination is less than 2 and score greater than 15
exam_data.loc[(exam_data['attempts']<2) & (exam_data['score']>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [17]:
# Change the value in row 'd' to 11.5
exam_data.loc['d','score'] = 11.5
exam_data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [26]:
# calculate the sum of the examination attempts by the students
exam_data['attempts'].sum()

19

In [58]:
# drop a list of rows from a specified DataFrame
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
d = pd.DataFrame(d)
print(d)
print(d.drop([2,4]))

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

In [66]:
# obtain values of row 4
d.loc[4]

col1    5
col2    8
col3    1
Name: 4, dtype: int64

In [68]:
#obtain values of column
d['col1']

0    1
1    4
2    3
3    4
4    5
Name: col1, dtype: int64

In [77]:
# obtain values of when value is 4 in col1
d.loc[d['col1'] == 4]

   col1  col2  col3
1     4     5     8
3     4     7     0

In [84]:
# Check whether a given column is present in a DataFrame or not
if ('col1' or 'col2' or 'col3') in d.columns:
    print("col is present in data frame")
else:
    print("col is not present in data frame")
if 'col4' in d.columns:
    print("col4 is in data frame")
else:
    print("col4 is not in data frame")

col is present in data frame
col4 is not in data frame

In [80]:
d.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [81]:
d.index

RangeIndex(start=0, stop=5, step=1)

In [88]:
#  Get column index from column name of a given DataFrame
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
d = pd.DataFrame(d)
d.columns.get_loc('col3')

2

In [90]:
d.columns[0:2]

Index(['col1', 'col2'], dtype='object')

In [98]:
# program to select all columns, except one given column in a DataFrame
d[['col1', 'col2']]

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

In [108]:
# program to select all columns, except one given column in a DataFrame
d.loc[:,d.columns !='col3']

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

In [102]:
d.loc[[0,4]]

   col1  col2  col3
0     1     4     7
4     7     5    11

In [109]:
# program to remove last n rows of a given DataFrame
d.head(3)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

In [110]:
# program to remove last n rows of a given DataFrame
d.drop([3,4])

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

In [127]:
# program to remove last n rows of a given DataFrame
d.loc[:2]

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

In [143]:
# display the movies longer than 30 minutes and shorter than 360 minutes
movies = pd.read_csv(r'C:\Users\Balaji\Downloads\uma\data\IMDB-Movie-Data.csv')
movie = movies[['Title', 'Runtime (Minutes)']]
mov = movie.loc[(movie['Runtime (Minutes)']>=30) & (movie['Runtime (Minutes)']<=360)]
print(mov)

                       Title  Runtime (Minutes)
0    Guardians of the Galaxy                121
1                 Prometheus                124
2                      Split                117
3                       Sing                108
4              Suicide Squad                123
..                       ...                ...
995     Secret in Their Eyes                111
996          Hostel: Part II                 94
997   Step Up 2: The Streets                 98
998             Search Party                 93
999               Nine Lives                 87

[1000 rows x 2 columns]